In [1]:
import pandas as pd

# Define a dictionary containing lists of data
people = {
    'first':['Corey','Jane','John'],
    'last': ['Schafer','Doe','Doe'],
    'email':['CoreySchafer@gmail.com','JaneDoe@gmail.com','JohnDoe@gmail.com']
}

# Create a DataFrame using the dictionary
df = pd.DataFrame(people)
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [2]:
# Access the column labels of the DataFrame
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [3]:
# Rename the columns of the DataFrame
df.columns = ['first name', 'last name', 'email']
df

  first name last name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [4]:
# Convert all column names to uppercase
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [5]:
# Replace spaces in column names with underscores
df.columns = [x for x in df.columns.str.replace(' ', '_')]
df

  FIRST_NAME LAST_NAME                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [6]:
# Rename the columns 'FIRST_NAME' to 'first' and 'LAST_NAME' to 'last' in the DataFrame
df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME':'last'}, inplace=True)
df

   first     last                   EMAIL
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [7]:
# Rename the columns 'FIRST_NAME' to 'first' and 'LAST_NAME' to 'last' in the DataFrame

df.rename(columns={'EMAIL':'email'}, inplace=True)
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [8]:
# Assign a new row to the DataFrame at index 2 with the values ['John', 'Smith', 'JohnSmith@gmail.com']
df.loc[2] = ['John','Smith','JohnSmith@gmail.com']
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John    Smith     JohnSmith@gmail.com

In [9]:
# Update the 'last' and 'email' columns for the row at index 2 with new values
df.loc[2,['last','email']] = ['Doe', 'JohnDoe@gmail.com']
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [10]:
# Update the 'last' column for the row at index 2 with the new value 'Smith'
df.loc[2,'last'] = 'Smith'
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John    Smith       JohnDoe@gmail.com

In [11]:
# Update the 'last' column for the row at index 2 with the new value 'Doe' using .at
df.at[2,'last'] = 'Doe'
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [12]:
 # Convert all email addresses in the 'email' column to lowercase
df['email'].str.lower()

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [13]:
# Convert values in the 'email' column to lowercase
df['email'] = df['email'].str.lower()
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [14]:
# Apply the len() function to each element in the 'email' column
df['email'].apply(len)

0    22
1    17
2    17
Name: email, dtype: int64

In [15]:
def update_email(email):
    return email.upper()

# Apply the update_email function to each element in the 'email' column
df['email'].apply(update_email)

0    COREYSCHAFER@GMAIL.COM
1         JANEDOE@GMAIL.COM
2         JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [16]:
df['email'] = df['email'].apply(update_email)
df

   first     last                   email
0  Corey  Schafer  COREYSCHAFER@GMAIL.COM
1   Jane      Doe       JANEDOE@GMAIL.COM
2   John      Doe       JOHNDOE@GMAIL.COM

In [17]:
 # Convert values in the 'email' column to lowercase using a lambda function
df['email'] = df['email'].apply(lambda x: x.lower())
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [18]:
# Apply the len() function to each column in the DataFrame df
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [19]:
# Apply the len() function to each row (along columns) in the DataFrame df
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [20]:
# Apply the max() function to each column in the DataFrame df
df.apply(pd.Series.max)

first                 John
last               Schafer
email    johndoe@gmail.com
dtype: object

In [21]:
# Apply a lambda function to find the minimum value in each column of the DataFrame df
df.apply(lambda x: x.min())

first                     Corey
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [22]:
df.map(len)

   first  last  email
0      5     7     22
1      4     3     17
2      4     3     17

In [23]:
 # Apply str.lower() method to each element in the DataFrame df
df.map(str.lower)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       janedoe@gmail.com
2   john      doe       johndoe@gmail.com

In [24]:
df['first'].map({'Corey':'chris', 'Jane':'mary'})

0    chris
1     mary
2      NaN
Name: first, dtype: object

In [25]:
# Replace specific values in the 'first' column of DataFrame df
df['first'] = df['first'].replace({'Corey':'Chris', 'Jane':'Mary'})
df

   first     last                   email
0  Chris  Schafer  coreyschafer@gmail.com
1   Mary      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com